In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

from numpy.random import randn

In [2]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [6]:
# drop an index
ser1.drop(index='b')

a    0
c    2
dtype: int32

In [9]:
dframe = DataFrame(np.arange(9).reshape(3,3), index=['sf','la','ny'],columns=['population','size','year'])
dframe

    population  size  year
sf           0     1     2
la           3     4     5
ny           6     7     8

In [11]:
# dropping an index/row
dframe2 = dframe.drop(index='la')
dframe2

    population  size  year
sf           0     1     2
ny           6     7     8

In [21]:
# dropping a column
dframe.drop(columns='year',axis=1)

    population  size
sf           0     1
la           3     4
ny           6     7